<a href="https://colab.research.google.com/github/allanstar-byte/IP_WEEK_3/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2020_11_ALLAN_NGOMA_PythonNotebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **1. Importing the Libraries to be used**

In [1]:
# importing pandas library

import pandas as pd
# as well as the Numpy library
import numpy as np

# **2. Loading our Datasets**

In [2]:
# importing CDR_Description.xls dataset
df1 = pd.read_excel('/content/CDR_description.xlsx') 
df1

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [3]:
#importing telcom_dataset.csv
df2 = pd.read_csv('/content/Telcom_dataset.csv') 
df2.head()

  PRODUTC  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0   04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
4   Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [4]:
#importing telcom_dataset2.csv
df3 = pd.read_csv('/content/Telcom_dataset2.csv') 
df3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [5]:
#importing telcom_dataset3.csv
df4 = pd.read_csv('/content/Telcom_dataset3.csv') 
df4.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [9]:
#importing cells_geo.csv
#seperating using the delimeter (;)
df5 = pd.read_csv('/content/cells_geo.csv',sep=';') 
df5.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [8]:
#importing cells_geo_description.xls
df6 = pd.read_excel('/content/cells_geo_description.xlsx') 
df6

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

# **3. Data Understanding and Exploration**

In [19]:
#displaying different data types of the columns
df7.dtypes

Unnamed: 0           int64
CITY                object
STATUS              object
LOCALISATION        object
DECOUPZONE          object
ZONENAME            object
LONGITUDE          float64
LATITUDE           float64
REGION              object
AREA                object
CELL_ID_x           object
SITE_ID_x           object
TIME                object
DATE                object
PRODUCT             object
VALUE                int64
CELL_ON_SITE        object
DW_A_NUMBER_INT     object
DW_B_NUMBER_INT     object
COUNTRY_A           object
COUNTRY_B           object
CELL_ID_y           object
SITE_ID_y           object
dtype: object

In [20]:
#identifying the precence of null values in the merged dataset
df7.isna().sum()

Unnamed: 0            0
CITY                  0
STATUS              201
LOCALISATION          0
DECOUPZONE            0
ZONENAME             18
LONGITUDE             0
LATITUDE              0
REGION                0
AREA                 69
CELL_ID_x             0
SITE_ID_x             0
TIME                  0
DATE               3974
PRODUCT               0
VALUE                 0
CELL_ON_SITE          0
DW_A_NUMBER_INT       0
DW_B_NUMBER_INT       0
COUNTRY_A             0
COUNTRY_B             0
CELL_ID_y             0
SITE_ID_y          1543
dtype: int64

In [21]:
#identifying the precence of duplicates values in the merged dataset
df7.duplicated().sum()

0

# **4. Data Preparation**

**4.1 Renaming columns**

In [22]:
#Renaming columns in Telcom_dataset.csv
#Renaming the column PRODUTC to PRODUCT
df2.rename(columns = {'PRODUTC':'PRODUCT'}, inplace = True)
df2
#Renaming the column DATETIME to TIME
df2.rename(columns = {'DATE_TIME':'TIME'}, inplace = True)
df2.head(2)

  PRODUCT  VALUE     TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [12]:
#Renaming columns in Telcom_dataset2.csv
#Renaming the column DW_A_NUMBER to DW_A_NUMBER_INT
df3.rename(columns = {'DW_A_NUMBER':'DW_A_NUMBER_INT'}, inplace = True)
df3
#Renaming the column DW_B_NUMBER to DW_B_NUMBER_INT
df3.rename(columns = {'DW_B_NUMBER':'DW_B_NUMBER_INT'}, inplace = True)
df3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [13]:
#Renaming columns in Telcom_dataset3.csv
#Renaming the column SIET_ID to SITE_ID
df4.rename(columns = {'SIET_ID':'SITE_ID'}, inplace = True)
df4.head(3)
#Renaming the column CELLID to CELL_ID
df4.rename(columns = {'CELLID':'CELL_ID'}, inplace = True)
df4.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [14]:
#renaming the SITE_CODE to SITE_ID the cells_geo.csv dataset
df5.rename(columns = {'SITE_CODE':'SITE_ID'}, inplace = True)

#renaming the VILLES to CITY the cells_geo.csv dataset
df5.rename(columns = {'VILLES':'CITY'}, inplace = True)
df5.head(3)

   Unnamed: 0    CITY      STATUS  ... AREA     CELL_ID     SITE_ID
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2  ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 12 columns]

**4.2 splitting date and time**

In [15]:
#splitting date and and column in Telcom_dataset2.csv
df60 = df3['DATE_TIME'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split(' '))]))
df60.columns = ['TIME', 'DATE']
df60
#merging to the original dataset
df70 = df60.merge(df3, left_index=True, right_index=True)
df70
#droping DATE_TIME column
df80 = df70.drop('DATE_TIME', axis=1)
df80.head()

         TIME        DATE PRODUCT  ...  COUNTRY_B     CELL_ID     SITE_ID
0  23:02:06.0  2012-05-07     sms  ...      19e2e  +854AcBQT2  +854AcBQT2
1  23:03:44.0  2012-05-07   Voice  ...      19e2e  +854AcBQT2  +854AcBQT2
2  23:04:06.0  2012-05-07     sms  ...      19e2e  +laSrk7g6q  +laSrk7g6q
3  23:04:48.0  2012-05-07   Voice  ...      19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4  23:04:58.0  2012-05-07     sms  ...      19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 11 columns]

In [16]:
#splitting date and and column in Telcom_dataset3.csv
df90 = df4['DATE_TIME'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split(' '))]))
df90.columns = ['TIME', 'DATE']
df90
#merging to the original dataset
df91 = df60.merge(df4, left_index=True, right_index=True)
df91
#droping DATE_TIME column
df100 = df91.drop('DATE_TIME', axis=1)
df100.head()

         TIME        DATE PRODUCT  ...  COUNTRY_B     CELL_ID     SITE_ID
0  23:02:06.0  2012-05-07   Voice  ...      19e2e  +38u2u/rfx  +38u2u/rfx
1  23:03:44.0  2012-05-07     sms  ...      19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2  23:04:06.0  2012-05-07   Voice  ...      19e2e  +ZaaZozy/+  +ZaaZozy/+
3  23:04:48.0  2012-05-07     sms  ...      19e2e  +cNeJzsTp3  +cNeJzsTp3
4  23:04:58.0  2012-05-07   Voice  ...      19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 11 columns]

**4.3 Merging datasets**

In [18]:
#merging telcom_dataset.csv, telcom_dataset2.csv using append since they are similar
df6 = df80.append([df100, df2])
df6
#merging the telcom_dataset.csv, telcom_dataset2.csv appended dataset with the Cells_geo.csv dataset
df7 = df5.merge(df6, left_index=True, right_index=True)
df7

      Unnamed: 0      CITY      STATUS  ... COUNTRY_B   CELL_ID_y   SITE_ID_y
0              0    ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
0              0    ADJAME  In Service  ...     19e2e  +38u2u/rfx  +38u2u/rfx
0              0    ADJAME  In Service  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1              1    ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
1              1    ADJAME  In Service  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
...          ...       ...         ...  ...       ...         ...         ...
3972        3972  ZUENOULA  In Service  ...     19e2e  846a0ea574  113d5b7f72
3972        3972  ZUENOULA  In Service  ...     19e2e  706d8914d0  22389546ec
3973        3973  ZUENOULA  In Service  ...     19e2e  bc1d885e30  a7bd4c027b
3973        3973  ZUENOULA  In Service  ...     19e2e  5a7f6cf0fa  2e828e607c
3973        3973  ZUENOULA  In Service  ...     19e2e  3424273a07  ae6cdb80c1

[11922 rows x 23 columns]

 **4.4 Dropping null values**

In [23]:
#dropping the null values
df8 = df7.dropna()
df8.isna().sum()

Unnamed: 0         0
CITY               0
STATUS             0
LOCALISATION       0
DECOUPZONE         0
ZONENAME           0
LONGITUDE          0
LATITUDE           0
REGION             0
AREA               0
CELL_ID_x          0
SITE_ID_x          0
TIME               0
DATE               0
PRODUCT            0
VALUE              0
CELL_ON_SITE       0
DW_A_NUMBER_INT    0
DW_B_NUMBER_INT    0
COUNTRY_A          0
COUNTRY_B          0
CELL_ID_y          0
SITE_ID_y          0
dtype: int64

In [24]:
#merged datased shape after dropping duplicated and null values
df8.shape

(6793, 23)

# **5. Analysis**

i will analyse the merged and cleaned dataset by answering different questions as follows:

In [25]:
df8.head()

    Unnamed: 0   CITY      STATUS  ... COUNTRY_B   CELL_ID_y   SITE_ID_y
23          23  ABOBO  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
23          23  ABOBO  In Service  ...     19e2e  2q0YsSCxbH  2q0YsSCxbH
24          24  ABOBO  In Service  ...     19e2e  +e+xcimwre  +e+xcimwre
24          24  ABOBO  In Service  ...     19e2e  1MTLUFpdzd  1MTLUFpdzd
25          25  ABOBO  In Service  ...     19e2e  +pZNtCvhmT  +pZNtCvhmT

[5 rows x 23 columns]

In [26]:
#1. Which ones were the most used city for the three days?
h = df8.groupby(['CITY', 'DATE', 'REGION']).sum().reset_index()
h.sort_values('DATE', ascending=False).head(5)

               CITY        DATE         REGION  ...  LONGITUDE   LATITUDE  VALUE
256  KIMBIRILA NORD  2012-05-08       DENGUELE  ... -45.085333  62.173833     25
334       MONTCOUPE  2012-05-08  BAS SASSANDRA  ... -44.542167  30.030667    125
347      NANIEFONGO  2012-05-08         SAVANE  ... -15.431917  29.355167      0
346       NAMBENGUE  2012-05-08         SAVANE  ... -31.971667  60.337000    320
345         NAMASSI  2012-05-08         ZANZAN  ... -17.192778  39.722222    138

[5 rows x 7 columns]

In [27]:
#2. Which cities were the most used during business and home hour
z = df8.groupby(['CITY', 'TIME', 'REGION']).sum().reset_index()
z.sort_values('TIME', ascending=0).head(10)

           CITY        TIME        REGION  ...  LONGITUDE   LATITUDE  VALUE
1059    PLATEAU  23:59:56.0        LAGUNE  ...  -4.024028   5.334806      0
1058    PLATEAU  23:59:55.0        LAGUNE  ...  -4.024028   5.334806      0
946     MARCORY  23:59:51.0        LAGUNE  ...  -3.959028   5.282750      0
945     MARCORY  23:59:50.0        LAGUNE  ...  -3.959028   5.282750     50
944     MARCORY  23:59:48.0        LAGUNE  ...  -3.959028   5.282750      0
943     MARCORY  23:59:40.0        LAGUNE  ...  -3.959028   5.282750      0
506    BIANOUAN  23:59:38.0   MOYEN COMOE  ... -12.728889  24.063667    101
505    BIANOUAN  23:59:35.0   MOYEN COMOE  ...  -6.364444  12.031833     45
504   BIANKOUMA  23:59:27.0  18 MONTAGNES  ... -15.221444  15.492278    122
503   BIANKOUMA  23:59:23.0  18 MONTAGNES  ... -15.221444  15.492278    480

[10 rows x 7 columns]

In [28]:
#3. Most used city for the three days?
P = df8.groupby(['CITY', 'DATE']).sum().reset_index()
P.sort_values('DATE', ascending=0).head(1)

               CITY        DATE  Unnamed: 0  LONGITUDE   LATITUDE  VALUE
256  KIMBIRILA NORD  2012-05-08       11844 -45.085333  62.173833     25

In [29]:
#4. The most used zone
df8['ZONENAME'].max()

'ZONE E - SUD-OUEST'

In [30]:
#5. The most used Region
df8['REGION'].max()

'ZANZAN'

In [31]:
#6. The most used product
df8['PRODUCT'].max()

'sms'

In [32]:
#7. finding the most used product in each region
l = df8.groupby(['PRODUCT', 'REGION']).sum().reset_index()
l.sort_values('REGION', ascending=0).head(10)

   PRODUCT             REGION  Unnamed: 0   LONGITUDE     LATITUDE  VALUE
49     sms             ZANZAN      208621 -317.709781   801.240658    975
30    data             ZANZAN        5389  -12.133389    31.983278      0
18   Voice             ZANZAN      154406 -210.452833   560.807028   3122
17   Voice         WORODOUGOU      145383 -438.865269   568.538228   3368
29    data         WORODOUGOU        1332   -6.615333     8.188250      0
48     sms         WORODOUGOU      213774 -588.435722   761.339172    825
28    data  VALLEE DU BANDAMA        1486  -15.038417    23.057611      0
16   Voice  VALLEE DU BANDAMA      194837 -581.178886   900.193522   6007
47     sms  VALLEE DU BANDAMA      267202 -855.790483  1362.857928   1758
46     sms          SUD COMOE      136485 -261.758647   444.694711    775

In [33]:
#8. describing the product column
df8['PRODUCT'].describe()

count     6793
unique       3
top        sms
freq      4026
Name: PRODUCT, dtype: object

In [34]:
#9. describing the STATUS column
df8['STATUS'].describe()

count           6793
unique             1
top       In Service
freq            6793
Name: STATUS, dtype: object

In [35]:
#10. General descriptive statistics
df8.describe()

        Unnamed: 0    LONGITUDE     LATITUDE        VALUE
count  6793.000000  6793.000000  6793.000000  6793.000000
mean   1959.375239    -4.851291     6.221870    27.272192
std    1159.200290     1.282982     1.294425   131.828869
min      23.000000    -8.503889     0.000000     0.000000
25%     910.000000    -5.750028     5.338500     0.000000
50%    1963.000000    -4.078500     5.450278     0.000000
75%    2959.000000    -3.992333     6.843278    25.000000
max    3973.000000    -0.000000    10.481861  6750.000000

In [36]:
#11. longitute and latitude skewness
df8.skew()

Unnamed: 0     0.017714
LONGITUDE     -0.763337
LATITUDE       1.097304
VALUE         29.466853
dtype: float64

In [38]:
#12. correlation matrix of the longitute and latitude
df8.corr()

            Unnamed: 0  LONGITUDE  LATITUDE     VALUE
Unnamed: 0    1.000000  -0.163973  0.053897  0.011023
LONGITUDE    -0.163973   1.000000 -0.466734  0.014720
LATITUDE      0.053897  -0.466734  1.000000 -0.019291
VALUE         0.011023   0.014720 -0.019291  1.000000